<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [24]:
!pip install sqlalchemy==1.3.9

Requirement already satisfied: sqlalchemy==1.3.9 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (1.3.9)

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [25]:
#Please uncomment and execute the code below if you are working locally.

!pip install ipython-sql

Requirement already satisfied: ipython-sql in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (0.3.9)
Requirement already satisfied: prettytable in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: ipython>=1.0 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython-sql) (7.33.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython-sql) (1.3.9)
Requirement already satisfied: sqlparse in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: setuptools>=18.5 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (67.7.2)
Requirement already satisfied: jedi>=0.16 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.18.2)
Requirement already satisfied: decorator in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: pickleshare in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (5.9.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (3.0.38)
Requirement already satisfied: pygments in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (2.15.1)
Requirement already satisfied: backcall in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.1.6)
Requirement already satisfied: pexpect>4.3 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: importlib-metadata in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from prettytable->ipython-sql) (4.11.4)
Requirement already satisfied: wcwidth in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from pexpect>4.3->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: zipp>=0.5 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from importlib-metadata->prettytable->ipython-sql) (3.15.0)
Requirement already satisfied: typing-extensions>=3.6.4 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (from importlib-metadata->prettytable->ipython-sql) (4.5.0)

In [26]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [27]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [28]:
!pip install -q pandas==1.1.5

In [29]:
%sql sqlite:///my_data1.db

'Connected: @my_data1.db'

In [30]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

**Note:This below code is added to remove blank rows from table**

In [31]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
(sqlite3.OperationalError) table SPACEXTABLE already exists
[SQL: create table SPACEXTABLE as select * from SPACEXTBL where Date is not null]
(Background on this error at: http://sqlalche.me/e/e3q8)

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [35]:
query = "SELECT DISTINCT Launch_Site FROM SPACEXTABLE"
unique_launch_sites = %sql $query
unique_launch_sites

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [36]:
query = "SELECT * FROM SPACEXTABLE WHERE Launch_Site LIKE 'CCA%' LIMIT 5"
launch_sites_CCA = %sql $query
launch_sites_CCA

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [37]:
query = "SELECT SUM(PAYLOAD_MASS__KG_) AS Total_Payload_Mass FROM SPACEXTABLE WHERE Customer = 'NASA (CRS)'"
total_payload_mass_NASA = %sql $query
total_payload_mass_NASA

 * sqlite:///my_data1.db
Done.

[(45596,)]

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [38]:
query = "SELECT AVG(PAYLOAD_MASS__KG_) AS Avg_Payload_Mass FROM SPACEXTABLE WHERE Booster_Version = 'F9 v1.1'"
avg_payload_mass_F9v1 = %sql $query
avg_payload_mass_F9v1

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [39]:
query = "SELECT MIN(Date) AS First_Successful_Landing_GRD FROM SPACEXTABLE WHERE Landing__Outcome = 'Success (ground pad)'"
first_successful_landing_GRD = %sql $query
first_successful_landing_GRD

 * sqlite:///my_data1.db
(sqlite3.OperationalError) no such column: Landing__Outcome
[SQL: SELECT MIN(Date) AS First_Successful_Landing_GRD FROM SPACEXTABLE WHERE Landing__Outcome = 'Success (ground pad)']
(Background on this error at: http://sqlalche.me/e/e3q8)

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [40]:
query = """
SELECT DISTINCT Booster_Version 
FROM SPACEXTABLE 
WHERE Landing__Outcome IN ('Success (drone ship)', 'Success (ground pad)')
"""
successful_boosters = %sql $query
successful_boosters

 * sqlite:///my_data1.db
(sqlite3.OperationalError) no such column: Landing__Outcome
[SQL: SELECT DISTINCT Booster_Version
FROM SPACEXTABLE
WHERE Landing__Outcome IN ('Success (drone ship)', 'Success (ground pad)')]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Task 7




##### List the total number of successful and failure mission outcomes

In [41]:
query = """
SELECT 
    Mission_Outcome, 
    COUNT(*) AS Total
FROM 
    SPACEXTABLE 
GROUP BY 
    Mission_Outcome
"""
mission_outcomes = %sql $query
mission_outcomes

 * sqlite:///my_data1.db
Done.

[('Failure (in flight)', 1),
 ('Success', 98),
 ('Success ', 1),
 ('Success (payload status unclear)', 1)]

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [42]:
query = """
SELECT Booster_Version
FROM SPACEXTABLE 
WHERE PAYLOAD_MASS__KG_ = (SELECT MAX(PAYLOAD_MASS__KG_) FROM SPACEXTABLE)
"""
boosters_max_payload = %sql $query
boosters_max_payload

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**

In [43]:
query = """
SELECT 
    Date,
    strftime('%m', Date) AS Month,
    strftime('%d', Date) AS Day,
    strftime('%Y', Date) AS Year
FROM 
    SPACEXTABLE
"""
date_columns = %sql $query
date_columns

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '06', '04', '2010'),
 ('2010-12-08', '12', '08', '2010'),
 ('2012-05-22', '05', '22', '2012'),
 ('2012-10-08', '10', '08', '2012'),
 ('2013-03-01', '03', '01', '2013'),
 ('2013-09-29', '09', '29', '2013'),
 ('2013-12-03', '12', '03', '2013'),
 ('2014-01-06', '01', '06', '2014'),
 ('2014-04-18', '04', '18', '2014'),
 ('2014-07-14', '07', '14', '2014'),
 ('2014-08-05', '08', '05', '2014'),
 ('2014-09-07', '09', '07', '2014'),
 ('2014-09-21', '09', '21', '2014'),
 ('2015-01-10', '01', '10', '2015'),
 ('2015-02-11', '02', '11', '2015'),
 ('2015-03-02', '03', '02', '2015'),
 ('2015-04-14', '04', '14', '2015'),
 ('2015-04-27', '04', '27', '2015'),
 ('2015-06-28', '06', '28', '2015'),
 ('2015-12-22', '12', '22', '2015'),
 ('2016-01-17', '01', '17', '2016'),
 ('2016-03-04', '03', '04', '2016'),
 ('2016-04-08', '04', '08', '2016'),
 ('2016-05-06', '05', '06', '2016'),
 ('2016-05-27', '05', '27', '2016'),
 ('2016-06-15', '06', '15', '2016'),
 ('2016-07-18', '07', '18', '2016'),
 ('2016-08-14', '08', '14', '2016'),
 ('2017-01-14', '01', '14', '2017'),
 ('2017-02-19', '02', '19', '2017'),
 ('2017-03-16', '03', '16', '2017'),
 ('2017-03-30', '03', '30', '2017'),
 ('2017-05-01', '05', '01', '2017'),
 ('2017-05-15', '05', '15', '2017'),
 ('2017-06-03', '06', '03', '2017'),
 ('2017-06-23', '06', '23', '2017'),
 ('2017-06-25', '06', '25', '2017'),
 ('2017-07-05', '07', '05', '2017'),
 ('2017-08-14', '08', '14', '2017'),
 ('2017-08-24', '08', '24', '2017'),
 ('2017-09-07', '09', '07', '2017'),
 ('2017-10-09', '10', '09', '2017'),
 ('2017-10-11', '10', '11', '2017'),
 ('2017-10-30', '10', '30', '2017'),
 ('2017-12-15', '12', '15', '2017'),
 ('2017-12-23', '12', '23', '2017'),
 ('2018-01-08', '01', '08', '2018'),
 ('2018-01-31', '01', '31', '2018'),
 ('2018-02-22', '02', '22', '2018'),
 ('2018-03-06', '03', '06', '2018'),
 ('2018-03-30', '03', '30', '2018'),
 ('2018-04-02', '04', '02', '2018'),
 ('2018-04-18', '04', '18', '2018'),
 ('2018-05-11', '05', '11', '2018'),
 ('2018-05-22', '05', '22', '2018'),
 ('2018-06-04', '06', '04', '2018'),
 ('2018-06-29', '06', '29', '2018'),
 ('2018-07-22', '07', '22', '2018'),
 ('2018-07-25', '07', '25', '2018'),
 ('2018-08-07', '08', '07', '2018'),
 ('2018-09-10', '09', '10', '2018'),
 ('2018-10-08', '10', '08', '2018'),
 ('2018-11-15', '11', '15', '2018'),
 ('2018-12-03', '12', '03', '2018'),
 ('2018-12-05', '12', '05', '2018'),
 ('2018-12-23', '12', '23', '2018'),
 ('2019-01-11', '01', '11', '2019'),
 ('2019-02-22', '02', '22', '2019'),
 ('2019-03-02', '03', '02', '2019'),
 ('2019-05-04', '05', '04', '2019'),
 ('2019-05-24', '05', '24', '2019'),
 ('2019-06-12', '06', '12', '2019'),
 ('2019-07-25', '07', '25', '2019'),
 ('2019-08-06', '08', '06', '2019'),
 ('2019-11-11', '11', '11', '2019'),
 ('2019-12-05', '12', '05', '2019'),
 ('2019-12-17', '12', '17', '2019'),
 ('2020-01-07', '01', '07', '2020'),
 ('2020-01-19', '01', '19', '2020'),
 ('2020-01-29', '01', '29', '2020'),
 ('2020-02-17', '02', '17', '2020'),
 ('2020-03-07', '03', '07', '2020'),
 ('2020-03-18', '03', '18', '2020'),
 ('2020-04-22', '04', '22', '2020'),
 ('2020-05-30', '05', '30', '2020'),
 ('2020-06-04', '06', '04', '2020'),
 ('2020-06-13', '06', '13', '2020'),
 ('2020-06-30', '06', '30', '2020'),
 ('2020-07-20', '07', '20', '2020'),
 ('2020-08-07', '08', '07', '2020'),
 ('2020-08-18', '08', '18', '2020'),
 ('2020-08-30', '08', '30', '2020'),
 ('2020-09-03', '09', '03', '2020'),
 ('2020-10-06', '10', '06', '2020'),
 ('2020-10-18', '10', '18', '2020'),
 ('2020-10-24', '10', '24', '2020'),
 ('2020-11-05', '11', '05', '2020'),
 ('2020-11-16', '11', '16', '2020'),
 ('2020-11-21', '11', '21', '2020'),
 ('2020-11-25', '11', '25', '2020'),
 ('2020-12-06', '12', '06', '2020')]

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [44]:
query = """
SELECT 
    Landing__Outcome, 
    COUNT(*) AS Outcome_Count
FROM 
    SPACEXTABLE 
GROUP BY 
    Landing__Outcome
ORDER BY 
    Outcome_Count DESC
"""
landing_outcomes_ranked = %sql $query
landing_outcomes_ranked

 * sqlite:///my_data1.db
(sqlite3.OperationalError) no such column: Landing__Outcome
[SQL: SELECT
    Landing__Outcome,
    COUNT(*) AS Outcome_Count
FROM
    SPACEXTABLE
GROUP BY
    Landing__Outcome
ORDER BY
    Outcome_Count DESC]
(Background on this error at: http://sqlalche.me/e/e3q8)

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>